# IFCGuidKey Properties

---
The IFCGuidKey type exposes the following members.
| Name| Description
---|---|---
| IFCGlobalId|  IFC GlobalId for map.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace